In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dframe = DataFrame({'k1': ['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

In [3]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.307278 -0.091722
1  X   beta -1.069732 -2.082362
2  Y  alpha -0.455927 -0.708633
3  Y   beta  2.215915  0.431766
4  Z  alpha  1.055917 -0.929687

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X   -0.688505
Y    0.879994
Z    1.055917
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.307278 -0.091722
1  X   beta -1.069732 -2.082362
2  Y  alpha -0.455927 -0.708633
3  Y   beta  2.215915  0.431766
4  Z  alpha  1.055917 -0.929687

In [9]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -1.069732
    JAN   -0.455927
NY  FEB    2.215915
    JAN    0.374320
Name: dataset1, dtype: float64

In [10]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.688505 -1.087042
Y   0.879994 -0.138434
Z   1.055917 -0.929687

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.307278 -0.091722
   beta  -1.069732 -2.082362
Y  alpha -0.455927 -0.708633
   beta   2.215915  0.431766
Z  alpha  1.055917 -0.929687

In [12]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [13]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.091722
   beta  -2.082362
Y  alpha -0.708633
   beta   0.431766
Z  alpha -0.929687

In [14]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [15]:
for name, group in dframe.groupby('k1'):
  print('This is the {} group'.format(name))
  print(group)
  print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.307278 -0.091722
1  X   beta -1.069732 -2.082362


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.455927 -0.708633
3  Y   beta  2.215915  0.431766


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.055917 -0.929687

In [16]:
for (k1,k2), group in dframe.groupby(['k1', 'k2']):
  print('key1={} key2={}'.format(k1,k2))
  print(group)
  print('\n')

key1=X key2=alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.307278 -0.091722


key1=X key2=beta
  k1    k2  dataset1  dataset2
1  X  beta -1.069732 -2.082362


key1=Y key2=alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.455927 -0.708633


key1=Y key2=beta
  k1    k2  dataset1  dataset2
3  Y  beta  2.215915  0.431766


key1=Z key2=alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.055917 -0.929687

In [17]:
gr = dframe.groupby('k1')

In [18]:
gr.get_group('X')

  k1     k2  dataset1  dataset2
0  X  alpha -0.307278 -0.091722
1  X   beta -1.069732 -2.082362

In [19]:
group_dict = dict(list(dframe.groupby('k1')))

In [21]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.307278 -0.091722
1  X   beta -1.069732 -2.082362

In [22]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [23]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.307278 -0.091722
 1 -1.069732 -2.082362
 2 -0.455927 -0.708633
 3  2.215915  0.431766
 4  1.055917 -0.929687, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}